# Filtering and Ordering

## Introduction

One of the most powerful aspects of SQL is the ability to include only relevant data in your query results. In this lesson, you'll learn some additional techniques for limiting the results of your SQL queries using the `WHERE` clause as well as the `ORDER BY` clause combined with the `LIMIT` clause.

## Objectives
You will be able to:
- Write SQL queries to filter and order results
- Order the results of your queries by using `ORDER BY` (`ASC` & `DESC`)
- Limit the number of records returned by a query using `LIMIT`
- Filter results using `BETWEEN` and `IS NULL`

## The Data



For this lesson we'll be using a database called `pets_database.db` containing a table called `cats`.

The `cats` table is populated with the following data:

|id  |name     |age    |breed              |owner_id|
|----|---------|-------|-------------------|-----------|
|1   |Maru     |3.0    |Scottish Fold      |1.0        |
|2   |Hana     |1.0    |Tabby              |1.0        |
|3   |Lil' Bub |5.0    |American Shorthair |NaN        |
|4   |Moe      |10.0   |Tabby              |NaN        |
|5   |Patches  |2.0    |Calico             |NaN        |
|6   |None     |NaN    |Tabby              |NaN        |

### Creating our Database

In the cell below, we connect to the database and select all of the records:

> In the cell below, type the code to import the necessary package, then create a connection to the database, and finally create a cursor object.

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">python
import pandas as pd
import sqlite3 
conn = sqlite3.connect('pets_database.db')
cur = conn.cursor()
    </code></pre>
</details>

In [1]:
# replace this comment with the code to import sqlite3
# replace this comment with the code to create the database connection
# replace this comment with the code to create the cursor object

**Let's check out our `cats` table with a SQL query:**

**Note:** the method `.fetchall()` returns a `list` where each record is represented as a `tuple`, which you can think of as a `list`-like object. If you would like to retrieve an element from a `tuple`, you simply access it by index -- similar to how you access the elements of a normal Python list. (i.e. `example_tuple[0]` - returns element at index `0`)

> In the cell below, type your query to select all of the records in the `cats` table.

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT *
  FROM cats;
'''
    </code></pre>
</details>

In [ ]:
# replace None with the query text (remember to use triple quotes for multi-line strings)
query = None 

cur.execute(query).fetchall()

---
#### Expected Output
<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Expand Complete Output</u></b>
    </summary>
    <pre><code language="python">[(1, 'Maru', 3, 'Scottish Fold', 1),
 (2, 'Hana', 1, 'Tabby', 1),
 (3, "Lil' Bub", 5, 'American Shorthair', None),
 (4, 'Moe', 10, 'Tabby', None),
 (5, 'Patches', 2, 'Calico', None),
 (6, None, None, 'Tabby', None)]
    </code></pre>
</details>

---

### `ORDER BY`

The first query modifier you'll explore is `ORDER BY`. This modifier allows us to order the table rows returned by a certain `SELECT` statement. Here's a boilerplate `SELECT` statement that uses `ORDER BY`:

```sql
SELECT column_name(s) 
  FROM table_name 
 ORDER BY column_name ASC|DESC;
```

**Let's select our cats and order them by age:**

> In the cell below, type the code to select all records from `cats` and order them by `age`.

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT *
  FROM cats 
 ORDER BY age;
'''
    </code></pre>
</details>

In [3]:
# replace None with the query text (remember to use triple quotes for multi-line strings)
query = None 

cur.execute(query).fetchall()

---
#### Expected Output
<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Expand Complete Output</u></b>
    </summary>
    <pre><code language="python">[(6, None, None, 'Tabby', None),
 (2, 'Hana', 1, 'Tabby', 1),
 (5, 'Patches', 2, 'Calico', None),
 (1, 'Maru', 3, 'Scottish Fold', 1),
 (3, "Lil' Bub", 5, 'American Shorthair', None),
 (4, 'Moe', 10, 'Tabby', None)] 
    </code></pre>
</details>

---

When using `ORDER BY`, the default is to order in ascending order. If you want to specify though, you can use `ASC` for "ascending" or `DESC` for "descending." **Let's try to select all of our cats and sort them by age in descending order.**

> In the cell below, type your query to select all records from `cats` and sort them in descending order:

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT *
  FROM cats 
 ORDER BY age DESC;
'''
    </code></pre>
</details>

In [ ]:
# replace None with the query text (remember to use triple quotes for multi-line strings)
query = None 

cur.execute(query).fetchall()

---
#### Expected Output
<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Expand Complete Output</u></b>
    </summary>
    <pre><code language="python">[(4, 'Moe', 10, 'Tabby', None),
 (3, "Lil' Bub", 5, 'American Shorthair', None),
 (1, 'Maru', 3, 'Scottish Fold', 1),
 (5, 'Patches', 2, 'Calico', None),
 (2, 'Hana', 1, 'Tabby', 1),
 (6, None, None, 'Tabby', None)]
    </code></pre>
</details>

---

### `LIMIT`

What if you want the oldest cat? If you want to select extremes from a database table––for example, the employee with the highest paycheck or the patient with the most recent appointment––we can use `ORDER BY` in conjunction with `LIMIT`.

`LIMIT` is used to determine the number of records you want to return from a dataset. For example:

```sql
SELECT *
  FROM cats 
 ORDER BY age DESC LIMIT 1;
```

**Note:** When you would only like the first result (or one result as is the case in the example above) you can use the sqlite3 method `.fetchone()` which, instead of returning a list of results, returns the first result (or the record at index 0). you can use this in place of or in conjunction with `LIMIT 1` in order to get back a single element.

> In the cell below, type your query to select all records from `cats`, sort them in descending order, and return only the first record using `LIMIT`:

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT *
  FROM cats
 ORDER BY age DESC LIMIT 1;
'''
cur.execute(query).fetchall()
    </code></pre>
</details>

In [ ]:
# replace None with the query text (remember to use triple quotes for multi-line strings)
query = None 

# replace this comment with the code to execute the query using .fetchall()

---
#### Expected Output
<pre><code>[(4, 'Moe', 10, 'Tabby', None)]
</code></pre>

---

Now take a look at the result using `.fetchone()` instead of `LIMIT`:

> In the cell below, type your query to select all records from `cats`, sort them in descending order, and return only the first record using `fetchone()`:

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT *
  FROM cats
 ORDER BY age DESC;
'''
cur.execute(query).fetchone()
    </code></pre>
</details>

In [5]:
# replace None with the query text (remember to use triple quotes for multi-line strings)
query = None 

# replace this comment with the code to execute the query using .fetchone()

This part of the statement: `SELECT * FROM cats ORDER BY age DESC` returns all of the cats in order from oldest to youngest. Using `fetchone()` returns just the first, i.e. oldest, cat on the list as in the previous example with the use of `LIMIT 1`.

What if we wanted to select the `2` oldest cats?

> In the cell below, type the query to select all records from `cats`, sort them in descending order and return the first 2 records using `LIMIT`, then type the code to execute the query:

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT *
  FROM cats
 ORDER BY age DESC LIMIT 2;
cur.execute(query).fetchall()
    </code></pre>
</details>

In [6]:
# replace None with the query text (remember to use triple quotes for multi-line strings)
query = None 

# replace this comment with the code to execute the query

---
#### Expected Output
<pre><code>[(4, 'Moe', 10, 'Tabby', None), (3, "Lil' Bub", 5, 'American Shorthair', None)]
</code></pre>

---

### `BETWEEN`

As we've already established, being able to sort and select specific data sets is important. Continuing on with our example, let's say you urgently need to select all of the cats whose age is between 1 and 3. To create such a query, you can use `BETWEEN`. Here's a boilerplate `SELECT` statement using `BETWEEN`:

```sql
SELECT column_name(s) 
  FROM table_name 
 WHERE column_name BETWEEN value1 AND value2;
```

Let's try it out on our `cats` table:

> In the cell below, type your query to select `name` from `cats` with ages `BETWEEN` `1` and `3`, then type the code to execute the query:

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
query = '''
SELECT name
  FROM cats
 WHERE age BETWEEN 1 AND 3;
'''
cur.execute(query).findall()
    </code></pre>
</details>

In [7]:
# replace this comment with the code to generate a query for use in the curson execution

# replace this comment with the code to execute the query

---
#### Expected Output
<pre><code>[('Maru',), ('Hana',), ('Patches',)]
</code></pre>

---

### `IS NULL`

Some cats were added to the Database that weren't given a name. We can select these records with the `IS NULL` keyword.

> In the cell below, type the query to select all records from `cats` and filter to return all with a `null` value in the `name` field, then type the code to execute the query:

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT * 
  FROM cats 
 WHERE name IS NULL;
'''
cur.execute(query).findall()
    </code></pre>
</details>

In [ ]:
# replace this comment with the code to generate a query for use in the curson execution

# replace this comment with the code to execute the query

---
#### Expected Output
<pre><code>[(6, None, None, 'Tabby', None)]
</code></pre>

---

### `COUNT`

Now, let's talk about the SQL aggregate function `COUNT`.

**SQL aggregate functions** are SQL statements that group multiple items together and perform some calculation to get a value of significance such as the average of a column's values, the minimum and maximum values from a column, sum values in a column, or count a number of records that meet certain conditions. You can learn more about these SQL aggregators [here](http://www.sqlclauses.com/sql+aggregate+functions) and [here](http://zetcode.com/db/sqlite/select/).

For now, we'll just focus on `COUNT`, which counts the number of records that meet a certain condition. Here's a standard SQL query using `COUNT`:

```sql
SELECT COUNT(column_name) 
  FROM table_name
 WHERE column_name = [value]
```
Let's try it out and count the number of cats who have an `owner_id` of `1`:

> In the cell below, type the query to count the number of records in `cats` with a value of `1` in `owner_id`, then type the code to execute that query:

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT COUNT(owner_id) 
  FROM cats 
 WHERE owner_id = 1;
'''
cur.execute(query).fetchall()
    </code></pre>
</details>

In [9]:

# replace this comment with the code to generate a query for use in the curson execution

# replace this comment with the code to execute the query

[(2,)]

---
#### Expected Output
<pre><code>[(2,)]
</code></pre>

---

### `GROUP BY`

Lastly, we'll talk about the handy aggregate function `GROUP BY`. Like its name
suggests, it groups your results by a given column.

Let's take our table of cats

```bash
id          name        age         breed          owner_id  
----------  ----------  ----------  -------------  ----------
1           Maru        3           Scottish Fold  1         
2           Hana        1           Tabby          1         
3           Lil\' Bub   5           American Shor            
4           Moe         10          Tabby                    
5           Patches     2           Calico                   
6                                   Tabby                    
```

Here, you can see at a glance that there are three tabby cats and
one of every other breed — but what if you had a larger database
where you couldn't just tally up the number of cats *grouped by*
breed? That's where — you guessed it! — `GROUP BY` comes in handy.

> In the cell below, type the query to `COUNT` the number of each `breed` using `GROUP BY`, then type the code to execute the query:

<details>
    <summary style="cursor: pointer; display: inline">
        <b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT breed, COUNT(breed)
  FROM cats
 GROUP BY breed;
'''
cur.execute(query).fetchall()
    </code></pre>
</details>

In [ ]:
# replace this comment with the code to generate a query for use in the curson execution

# replace this comment with the code to execute the query

---
#### Expected Output
<pre><code>[('American Shorthair', 1), ('Calico', 1), ('Scottish Fold', 1), ('Tabby', 3)]
</code></pre>

---

`GROUP BY` is a great function for aggregating results into different
segments — you can even use it on multiple columns! Using `GROUP BY` on multiple columns will group by the first column as the primary key, and the second column as the secondary key.

> In the cell below, type the query to select `breed` and `owner_id` and return the `COUNT` of each value in `breed` ordered by `breed` as the primary key and `owner_id` as the secondary key:

<details>
    <summary style="cursor: pointer; display: inline"><b><u>Click to Reveal Code</u></b>
    </summary>
    <pre><code language="python">query = '''
SELECT breed, owner_id, COUNT(breed) 
  FROM cats 
 GROUP BY breed, owner_id;
'''
cur.execute(query).fetchall()
    </code></pre>
</details>

In [11]:
# execute above multiple column group by query here

This should return:

```python
[('American Shorthair', None, 1),
 ('Calico', None, 1),
 ('Scottish Fold', 1, 1),
 ('Tabby', None, 2),
 ('Tabby', 1, 1)]
```

### Note on `SELECT`

We are now familiar with this syntax:

```sql
SELECT name 
  FROM cats;
```

However, you may not know that this can be written like this as well:

```sql
SELECT cats.name 
  FROM cats;
```

Both return:

```python
[('Maru',), ('Hana',), ("Lil' Bub",), ('Moe',), ('Patches',), (None,)] 
```

SQLite allows us to explicitly state the `tableName.columnName` you want to select. This is particularly useful when you want data from two different tables.

Imagine you have another table called `dogs` with a column containing all of the dog names:

```sql
CREATE TABLE dogs(
  PRIMARY KEY (id),
  id INT,
  "name" TEXT,
);
```

```sql
INSERT INTO dogs ("name", id) 
VALUES ("Clifford", 2.0);
```


If you want to get the names of all the dogs and cats, you can no longer run a query with just the column name.
```sql
SELECT name 
  FROM cats,dogs;
``` 
will return:
```
Error: ambiguous column name: name
```

Instead, you must explicitly follow the `tableName.columnName` syntax.
```sql
SELECT cats.name, dogs.name 
  FROM cats, dogs;
```

You may see this in the future. Don't let it trip you up!

## Summary

In this lesson, you expanded your SQL knowledge by learning how to modify your data using statements like `ORDER BY`. 
Additionally, you learned how to filter and limit your results using the `BETWEEN`, `IS NULL`, and `LIMIT` statements.